ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_USBC.cpp
    Setup = (USB_SETUP_PACKET*)State->Data;

    switch (Setup->bRequest) {
    case USB_GET_STATUS:
        return STM32F7_UsbClient_HandleGetStatus(State, Setup);
    case USB_CLEAR_FEATURE:
        return STM32F7_UsbClient_HandleClearFeature(State, Setup);
    case USB_SET_FEATURE:
        return STM32F7_UsbClient_HandleSetFeature(State, Setup);
    case USB_SET_ADDRESS:
        return STM32F7_UsbClient_HandleSetAddress(State, Setup);
    case USB_GET_CONFIGURATION:
        return STM32F7_UsbClient_HandleGetConfiguration(State, Setup);
    case USB_SET_CONFIGURATION:
        return STM32F7_UsbClient_HandleSetConfiguration(State, Setup, true);
    default:
        return STM32F7_UsbClient_HandleConfigurationRequests(State, Setup);
    }

    return USB_STATE_STALL;
}

USB_PACKET64* STM32F7_UsbClient_RxEnqueue(USB_CONTROLLER_STATE* State, int endpoint, bool& disableRx) {
    USB_PACKET64* packet;

    if (usb_fifo_buffer_count[endpoint] == STM32F7_USB_FIFO_BUFFER_SIZE) {
        disableRx = true;

        return nullptr;
    }

    disableRx = false;

    packet = &State->Queues[endpoint][usb_fifo_buffer_in[endpoint]];

    usb_fifo_buffer_in[endpoint]++;
    usb_fifo_buffer_count[endpoint]++;

    if (usb_fifo_buffer_in[endpoint] == STM32F7_USB_FIFO_BUFFER_SIZE)
        usb_fifo_buffer_in[endpoint] = 0;

    STM32F7_UsbClient_SetEvent(State, 1 << endpoint);

    return packet;
}

USB_PACKET64* STM32F7_UsbClient_TxDequeue(USB_CONTROLLER_STATE* State, int endpoint) {
    USB_PACKET64* packet;

    if (usb_fifo_buffer_count[endpoint] == 0) {
        return nullptr;
    }

    packet = &State->Queues[endpoint][usb_fifo_buffer_out[endpoint]];

    usb_fifo_buffer_count[endpoint]--;
    usb_fifo_buffer_out[endpoint]++;

    if (usb_fifo_buffer_out[endpoint] == STM32F7_USB_FIFO_BUFFER_SIZE)
        usb_fifo_buffer_out[endpoint] = 0;

    return packet;
}

// For Api
TinyCLR_Result STM32F7_UsbClient_Acquire(const TinyCLR_UsbClient_Provider* self) {
    int32_t controller = self->Index;

    uint8_t *osStringDescriptor = (uint8_t*)&STM32F7_UsbClient_OsStringDescriptor;
    uint8_t *xCompatibleOsId = (uint8_t*)&STM32F7_UsbClient_XCompatibleOsId;
    uint8_t *xPropertiesOsWinUsb = (uint8_t*)&STM32F7_UsbClient_XPropertiesOsWinUsb;

    STM32F7_UsbClient_OsExtendedPropertyHandler(self, osStringDescriptor, xCompatibleOsId, xPropertiesOsWinUsb);

    USB_CONTROLLER_STATE *State = &STM32F7_UsbClient_ControllerState[controller].state;

    DISABLE_INTERRUPTS_SCOPED(irq);

    // Init UsbDefaultConfiguration
    memset(&UsbDefaultConfiguration, 0, sizeof(USB_DYNAMIC_CONFIGURATION));

    configDescriptor.epWrite.bEndpointAddress = USB_ENDPOINT_DIRECTION_IN;
    configDescriptor.epRead.bEndpointAddress = USB_ENDPOINT_DIRECTION_OUT;

    UsbDefaultConfiguration.device = (TinyCLR_UsbClient_DeviceDescriptor*)&deviceDescriptor;
    UsbDefaultConfiguration.config = (TinyCLR_UsbClient_ConfigurationDescriptor*)&configDescriptor;

    UsbDefaultConfiguration.manHeader = (TinyCLR_UsbClient_StringDescriptorHeader*)&stringManufacturerDescriptorHeader;
    UsbDefaultConfiguration.prodHeader = (TinyCLR_UsbClient_StringDescriptorHeader*)&stringProductNameDescriptorHeader;
    UsbDefaultConfiguration.displayStringHeader = (TinyCLR_UsbClient_StringDescriptorHeader*)&stringDisplayNameDescriptorHeader;
    UsbDefaultConfiguration.friendlyStringHeader = (TinyCLR_UsbClient_StringDescriptorHeader*)&stringFriendlyNameDescriptorHeader;

    UsbDefaultConfiguration.OS_String = (TinyCLR_UsbClient_OsStringDescriptor*)&STM32F7_UsbClient_OsStringDescriptor;
    UsbDefaultConfiguration.OS_XCompatible_ID = (TinyCLR_UsbClient_XCompatibleOsId*)&STM32F7_UsbClient_XCompatibleOsId;
    UsbDefaultConfiguration.OS_XProperty = (TinyCLR_UsbClient_XPropertiesOsWinUsb*)&STM32F7_UsbClient_XPropertiesOsWinUsb;

    UsbDefaultConfiguration.endList = (TinyCLR_UsbClient_DescriptorHeader*)&usbDescriptorHeader;

    // Init Usb State
    memset(State, 0, sizeof(USB_CONTROLLER_STATE));

    State->ControllerNum = controller;
    State->Configuration = &UsbDefaultConfiguration;
    State->CurrentState = USB_DEVICE_STATE_UNINITIALIZED;
    State->DeviceStatus = USB_STATUS_DEVICE_SELF_POWERED;
    State->EndpointCount = STM32F7_USB_FS_MAX_EP;
    State->PacketSize = MAX_EP0_SIZE;
    State->Initialized = true;

    for (auto i = 0; i < STM32F7_USB_QUEUE_SIZE; i++) {
        State->pipes[i].RxEP = USB_ENDPOINT_NULL;
        State->pipes[i].TxEP = USB_ENDPOINT_NULL;
        State->MaxPacketSize[i] = MAX_EP_SIZE;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_UsbClient_Release(const TinyCLR_UsbClient_Provider* self) {
    int32_t controller = self->Index;

    USB_CONTROLLER_STATE *State = &STM32F7_UsbClient_ControllerState[controller].state;

    if (State->Initialized) {
        DISABLE_INTERRUPTS_SCOPED(irq);

        STM32F7_UsbClient_Uninitialize(controller);

        State->Initialized = false;

        // for soft reboot allow the USB to be off for at least 100ms
        STM32F7_Time_Delay(nullptr, 100000); // 100ms
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_UsbClient_Open(const TinyCLR_UsbClient_Provider* self, int32_t& pipe, TinyCLR_UsbClient_PipeMode mode) {
    int32_t controller = self->Index;
    int32_t availablePipe;

    USB_CONTROLLER_STATE * State = &STM32F7_UsbClient_ControllerState[controller].state;

    if (!State->Initialized)     // If no such controller exists (or it is not initialized)
        return TinyCLR_Result::NotAvailable;

    int32_t writeEp = USB_ENDPOINT_NULL;
    int32_t readEp = USB_ENDPOINT_NULL;

    if (mode != TinyCLR_UsbClient_PipeMode::InOut)
        return TinyCLR_Result::NotSupported;

    for (auto i = 0; i < SIZEOF_ARRAY(STM32F7_UsbClient_EndpointMap); i++) {
        if ((STM32F7_UsbClient_EndpointMap[i] & ENDPOINT_INUSED_MASK)) // in used
            continue;

        if (writeEp == USB_ENDPOINT_NULL && ((STM32F7_UsbClient_EndpointMap[i] & ENDPOINT_DIR_IN_MASK) == ENDPOINT_DIR_IN_MASK)) {
            writeEp = i;
            STM32F7_UsbClient_EndpointMap[i] |= ENDPOINT_INUSED_MASK;

            continue;
        }

        if (readEp == USB_ENDPOINT_NULL && ((STM32F7_UsbClient_EndpointMap[i] & ENDPOINT_DIR_OUT_MASK) == ENDPOINT_DIR_OUT_MASK)) {
            readEp = i;
            STM32F7_UsbClient_EndpointMap[i] |= ENDPOINT_INUSED_MASK;

            continue;
        }

