ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_USBC.cpp
        if (writeEp != 0 && readEp != 0) {
            break;
        }
    }
    // Check the usbPipe and the two endpoint numbers for validity (both endpoints cannot be zero)
    if ((readEp == USB_ENDPOINT_NULL && writeEp == USB_ENDPOINT_NULL)
        || (readEp != USB_ENDPOINT_NULL && (readEp < 1 || readEp >= STM32F7_USB_QUEUE_SIZE))
        || (writeEp != USB_ENDPOINT_NULL && (writeEp < 1 || writeEp >= STM32F7_USB_QUEUE_SIZE)))
        return TinyCLR_Result::NotAvailable;

    // The specified endpoints must not be in use by another pipe
    for (int pipe = 0; pipe < STM32F7_USB_QUEUE_SIZE; pipe++) {
        if (readEp != USB_ENDPOINT_NULL && (State->pipes[pipe].RxEP == readEp || State->pipes[pipe].TxEP == readEp))
            return TinyCLR_Result::NotAvailable;;
        if (writeEp != USB_ENDPOINT_NULL && (State->pipes[pipe].RxEP == writeEp || State->pipes[pipe].TxEP == writeEp))
            return TinyCLR_Result::NotAvailable;;
    }

    for (availablePipe = 0; availablePipe < STM32F7_USB_QUEUE_SIZE; availablePipe++) {
        // The Pipe must be currently closed
        if (State->pipes[availablePipe].RxEP == USB_ENDPOINT_NULL && State->pipes[availablePipe].TxEP == USB_ENDPOINT_NULL)
            break;
    }

    if (availablePipe == STM32F7_USB_QUEUE_SIZE)
        return TinyCLR_Result::NotAvailable;; // full endpoint

    // All tests pass, assign the endpoints to the pipe
    State->pipes[availablePipe].RxEP = readEp;
    State->pipes[availablePipe].TxEP = writeEp;

    TinyCLR_UsbClient_ConfigurationDescriptor *config = (TinyCLR_UsbClient_ConfigurationDescriptor *)UsbDefaultConfiguration.config;
    TinyCLR_UsbClient_EndpointDescriptor  *ep = (TinyCLR_UsbClient_EndpointDescriptor  *)(((uint8_t *)config) + USB_CONFIGURATION_DESCRIPTOR_LENGTH + sizeof(TinyCLR_UsbClient_DescriptorHeader) + sizeof(TinyCLR_UsbClient_InterfaceDescriptor));

    uint8_t * end = ((uint8_t *)config) + config->header.size;
    uint32_t epType = ((STM32F7_UsbClient_State*)State)->endpointType;

    while (((uint8_t *)ep) != nullptr && ((uint8_t *)ep) < end) {
        if (USB_ENDPOINT_DESCRIPTOR_TYPE != ep->bDescriptorType || sizeof(TinyCLR_UsbClient_EndpointDescriptor) != ep->bLength)
            break;

        auto idx = 0;

        if (ep->bEndpointAddress == USB_ENDPOINT_DIRECTION_IN) {
            ep->bEndpointAddress |= writeEp;
            idx = writeEp;
            State->IsTxQueue[idx] = true;
        }

        else if (ep->bEndpointAddress == USB_ENDPOINT_DIRECTION_OUT) {
            ep->bEndpointAddress |= readEp;
            idx = readEp;
            State->IsTxQueue[idx] = false;
        }

        if (idx > 0) {
            if (apiProvider != nullptr) {
                auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

                State->Queues[idx] = (USB_PACKET64*)memoryProvider->Allocate(memoryProvider, STM32F7_USB_FIFO_BUFFER_SIZE * sizeof(USB_PACKET64));

                if (State->Queues[idx] == nullptr)
                    return TinyCLR_Result::ArgumentNull;;

                memset(reinterpret_cast<uint8_t*>(State->Queues[idx]), 0x00, STM32F7_USB_FIFO_BUFFER_SIZE * sizeof(USB_PACKET64));
            }

            STM32F7_UsbClient_ClearEndpoints(idx);

            epType |= (ep->bmAttributes & 3) << (idx * 2);
            State->MaxPacketSize[idx] = ep->wMaxPacketSize;
        }

        ep = (TinyCLR_UsbClient_EndpointDescriptor  *)(((uint8_t *)ep) + ep->bLength);
    }

    ((STM32F7_UsbClient_State*)State)->endpointType = epType;

    if (State->CurrentState == USB_DEVICE_STATE_UNINITIALIZED) {
        STM32F7_UsbClient_Initialize(controller);
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_UsbClient_Close(const TinyCLR_UsbClient_Provider* self, int32_t pipe) {
    int32_t controller = self->Index;

    USB_CONTROLLER_STATE * State = &STM32F7_UsbClient_ControllerState[controller].state;

    if (!State->Initialized || pipe >= STM32F7_USB_QUEUE_SIZE)
        return TinyCLR_Result::NotAvailable;

    DISABLE_INTERRUPTS_SCOPED(irq);

    // Close the Rx pipe
    int endpoint = State->pipes[pipe].RxEP;
    if (endpoint != USB_ENDPOINT_NULL && State->Queues[endpoint]) {
        STM32F7_UsbClient_ClearEndpoints(endpoint);
    }

    State->pipes[pipe].RxEP = USB_ENDPOINT_NULL;
    //Free endpoint
    STM32F7_UsbClient_EndpointMap[endpoint] &= ~ENDPOINT_INUSED_MASK;

    // Close the TX pipe
    endpoint = State->pipes[pipe].TxEP;
    if (endpoint != USB_ENDPOINT_NULL && State->Queues[endpoint] != nullptr) {
        STM32F7_UsbClient_ClearEndpoints(endpoint);

        if (apiProvider != nullptr) {
            auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

            if (State->Queues[endpoint] != nullptr)
                memoryProvider->Free(memoryProvider, State->Queues[endpoint]);

            State->Queues[endpoint] = nullptr;
        }
    }

    State->pipes[pipe].TxEP = USB_ENDPOINT_NULL;

    //Free endpoint
    STM32F7_UsbClient_EndpointMap[endpoint] &= ~ENDPOINT_INUSED_MASK;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_UsbClient_Write(const TinyCLR_UsbClient_Provider* self, int32_t pipe, const uint8_t* data, size_t& length) {
    int32_t controller = self->Index;

    USB_CONTROLLER_STATE * State = &STM32F7_UsbClient_ControllerState[controller].state;

    if (pipe >= STM32F7_USB_QUEUE_SIZE
        || data == nullptr
        || State->DeviceState != USB_DEVICE_STATE_CONFIGURED
        || length == 0) {
        return TinyCLR_Result::ArgumentInvalid;
    }

    int endpoint = State->pipes[pipe].TxEP;
    // If no Write side to pipe (or if not yet open)
    if (endpoint == USB_ENDPOINT_NULL || State->Queues[endpoint] == nullptr) {
        return TinyCLR_Result::NotAvailable;
    }

    DISABLE_INTERRUPTS_SCOPED(irq);

    const uint8_t*      ptr = data;
    uint32_t            count = length;
    bool                Done = false;
    uint32_t            WaitLoopCnt = 0;
    int                 totWrite = 0;

    // This loop packetizes the data and sends it out.  All packets sent have
    // the maximum length for the given endpoint except for the last packet which
    // will always have less than the maximum length - even if the packet length
    // must be zero for this to occur.   This is done to comply with standard
    // USB bulk-mode transfers.
    while (!Done) {

        USB_PACKET64* Packet64 = nullptr;

        if (usb_fifo_buffer_count[endpoint] < STM32F7_USB_FIFO_BUFFER_SIZE) {
            Packet64 = &State->Queues[endpoint][usb_fifo_buffer_in[endpoint]];

            usb_fifo_buffer_in[endpoint]++;
            usb_fifo_buffer_count[endpoint]++;

